/* automatically generated by rust-bindgen 0.69.1 */

use libc::FILE;

pub const BITWUZLA_SAT: BitwuzlaResult = 10;
pub const BITWUZLA_UNSAT: BitwuzlaResult = 20;
pub const BITWUZLA_UNKNOWN: BitwuzlaResult = 0;
pub type BitwuzlaResult = ::std::os::raw::c_uint;
pub const BITWUZLA_RM_RNE: BitwuzlaRoundingMode = 0;
pub const BITWUZLA_RM_RNA: BitwuzlaRoundingMode = 1;
pub const BITWUZLA_RM_RTN: BitwuzlaRoundingMode = 2;
pub const BITWUZLA_RM_RTP: BitwuzlaRoundingMode = 3;
pub const BITWUZLA_RM_RTZ: BitwuzlaRoundingMode = 4;
pub const BITWUZLA_RM_MAX: BitwuzlaRoundingMode = 5;
pub type BitwuzlaRoundingMode = ::std::os::raw::c_uint;
pub const BITWUZLA_KIND_CONSTANT: BitwuzlaKind = 0;
pub const BITWUZLA_KIND_CONST_ARRAY: BitwuzlaKind = 1;
pub const BITWUZLA_KIND_VALUE: BitwuzlaKind = 2;
pub const BITWUZLA_KIND_VARIABLE: BitwuzlaKind = 3;
pub const BITWUZLA_KIND_AND: BitwuzlaKind = 4;
pub const BITWUZLA_KIND_DISTINCT: BitwuzlaKind = 5;
pub const BITWUZLA_KIND_EQUAL: BitwuzlaKind = 6;
pub const BITWUZLA_KIND_IFF: BitwuzlaKind = 7;
pub const BITWUZLA_KIND_IMPLIES: BitwuzlaKind = 8;
pub const BITWUZLA_KIND_NOT: BitwuzlaKind = 9;
pub const BITWUZLA_KIND_OR: BitwuzlaKind = 10;
pub const BITWUZLA_KIND_XOR: BitwuzlaKind = 11;
pub const BITWUZLA_KIND_ITE: BitwuzlaKind = 12;
pub const BITWUZLA_KIND_EXISTS: BitwuzlaKind = 13;
pub const BITWUZLA_KIND_FORALL: BitwuzlaKind = 14;
pub const BITWUZLA_KIND_APPLY: BitwuzlaKind = 15;
pub const BITWUZLA_KIND_LAMBDA: BitwuzlaKind = 16;

pub const BITWUZLA_OPT_PROP_PROB_USE_INV_VALUE: BitwuzlaOption = 17;
pub const BITWUZLA_OPT_PROP_SEXT: BitwuzlaOption = 18;
pub const BITWUZLA_OPT_PROP_NORMALIZE: BitwuzlaOption = 19;
pub const BITWUZLA_OPT_PREPROCESS: BitwuzlaOption = 20;
pub const BITWUZLA_OPT_PP_CONTRADICTING_ANDS: BitwuzlaOption = 21;
pub const BITWUZLA_OPT_PP_ELIM_BV_EXTRACTS: BitwuzlaOption = 22;
pub const BITWUZLA_OPT_PP_EMBEDDED_CONSTR: BitwuzlaOption = 23;
pub const BITWUZLA_OPT_PP_FLATTEN_AND: BitwuzlaOption = 24;
pub const BITWUZLA_OPT_PP_NORMALIZE: BitwuzlaOption = 25;
pub const BITWUZLA_OPT_PP_NORMALIZE_SHARE_AWARE: BitwuzlaOption = 26;
pub const BITWUZLA_OPT_PP_SKELETON_PREPROC: BitwuzlaOption = 27;
pub const BITWUZLA_OPT_PP_VARIABLE_SUBST: BitwuzlaOption = 28;
pub const BITWUZLA_OPT_PP_VARIABLE_SUBST_NORM_EQ: BitwuzlaOption = 29;
pub const BITWUZLA_OPT_PP_VARIABLE_SUBST_NORM_DISEQ: BitwuzlaOption = 30;
pub const BITWUZLA_OPT_PP_VARIABLE_SUBST_NORM_BV_INEQ: BitwuzlaOption = 31;
pub const BITWUZLA_OPT_DBG_RW_NODE_THRESH: BitwuzlaOption = 32;
pub const BITWUZLA_OPT_DBG_PP_NODE_THRESH: BitwuzlaOption = 33;
pub const BITWUZLA_OPT_DBG_CHECK_MODEL: BitwuzlaOption = 34;
pub const BITWUZLA_OPT_DBG_CHECK_UNSAT_CORE: BitwuzlaOption = 35;
pub const BITWUZLA_OPT_NUM_OPTS: BitwuzlaOption = 36;
pub type BitwuzlaOption = ::std::os::raw::c_uint;
extern "C" {
    #[doc = " Get copyright information."]
    pub fn bitwuzla_copyright() -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " Get version information."]
    pub fn bitwuzla_version() -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " Get git information."]
    pub fn bitwuzla_git_id() -> *const ::std::os::raw::c_char;
}
#[doc = " The option info struct holds all information about an option, which can\n be queried via `bitwuzla_get_option_info`.\n\n @see\n   * `bitwuzla_get_option_info`"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct BitwuzlaOptionInfo {
    #[doc = " The Bitwuzla option."]
    pub opt: BitwuzlaOption,
    #[doc = " Short option name."]
    pub shrt: *const ::std::os::raw::c_char,
    #[doc = " Long option name."]
    pub lng: *const ::std::os::raw::c_char,
    #[doc = " Option description."]
    pub description: *const ::std::os::raw::c_char,
    #[doc = " Indicates whether values are numeric or strings."]
    pub is_numeric: bool,
    pub value: BitwuzlaOptionValue,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BitwuzlaOptionNumericValue {
    #[doc = " Current numeric option value."]
    pub cur: u64,
    #[doc = " Default numeric option value."]
    pub dflt: u64,
    #[doc = " Minimum numeric option value."]
    pub min: u64,
    #[doc = " Maximum numeric option value."]
    pub max: u64,
}
#[allow(non_snake_case)]
#[test]
fn bindgen_test_layout_BitwuzlaOptionNumericValue() {
    const UNINIT: ::std::mem::MaybeUninit<BitwuzlaOptionNumericValue> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BitwuzlaOptionNumericValue>(),
        32usize,
        concat!("Size of: ", stringify!(BitwuzlaOptionNumericValue))
    );
    assert_eq!(
        ::std::mem::align_of::<BitwuzlaOptionNumericValue>(),
        8usize,
        concat!("Alignment of ", stringify!(BitwuzlaOptionNumericValue))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cur) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BitwuzlaOptionNumericValue),
            "::",
            stringify!(cur)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dflt) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BitwuzlaOptionNumericValue),
            "::",
            stringify!(dflt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).min) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BitwuzlaOptionNumericValue),
            "::",
            stringify!(min)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BitwuzlaOptionNumericValue),
            "::",
            stringify!(max)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BitwuzlaOptionModeValue {
    #[doc = " Current mode option value."]
    pub cur: *const ::std::os::raw::c_char,
    #[doc = " Default mode option value."]
    pub dflt: *const ::std::os::raw::c_char,
    #[doc = " Number of available modes."]
    pub num_modes: usize,
    #[doc = " List of available modes."]
    pub modes: *mut *const ::std::os::raw::c_char,
}
#[allow(non_snake_case)]
#[test]
fn bindgen_test_layout_BitwuzlaOptionModeValue() {
    const UNINIT: ::std::mem::MaybeUninit<BitwuzlaOptionModeValue> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BitwuzlaOptionModeValue>(),
        32usize,
        concat!("Size of: ", stringify!(BitwuzlaOptionModeValue))
    );
    assert_eq!(
        ::std::mem::align_of::<BitwuzlaOptionModeValue>(),
        8usize,
        concat!("Alignment of ", stringify!(BitwuzlaOptionModeValue))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cur) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BitwuzlaOptionModeValue),
            "::",
            stringify!(cur)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dflt) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BitwuzlaOptionModeValue),
            "::",
            stringify!(dflt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num_modes) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BitwuzlaOptionModeValue),
            "::",
            stringify!(num_modes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).modes) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BitwuzlaOptionModeValue),
            "::",
            stringify!(modes)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union BitwuzlaOptionValue {
    pub numeric: BitwuzlaOptionNumericValue,
    pub mode: BitwuzlaOptionModeValue,
}
#[allow(non_snake_case)]
#[test]
fn bindgen_test_layout_BitwuzlaOptionValue() {
    const UNINIT: ::std::mem::MaybeUninit<BitwuzlaOptionValue> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BitwuzlaOptionValue>(),
        32usize,
        concat!("Size of: ", stringify!(BitwuzlaOptionValue))
    );
    assert_eq!(
        ::std::mem::align_of::<BitwuzlaOptionValue>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(BitwuzlaOptionValue)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numeric) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BitwuzlaOptionValue),
            "::",
            stringify!(numeric)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BitwuzlaOptionValue),
            "::",
            stringify!(mode)
        )
    );
}
#[allow(non_snake_case)]
#[test]
fn bindgen_test_layout_BitwuzlaOptionInfo() {
    const UNINIT: ::std::mem::MaybeUninit<BitwuzlaOptionInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BitwuzlaOptionInfo>(),
        72usize,
        concat!("Size of: ", stringify!(BitwuzlaOptionInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<BitwuzlaOptionInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(BitwuzlaOptionInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).opt) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BitwuzlaOptionInfo),
            "::",
            stringify!(opt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).shrt) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BitwuzlaOptionInfo),
            "::",
            stringify!(shrt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lng) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BitwuzlaOptionInfo),
            "::",
            stringify!(lng)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).description) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BitwuzlaOptionInfo),
            "::",
            stringify!(description)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).is_numeric) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(BitwuzlaOptionInfo),
            "::",
            stringify!(is_numeric)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BitwuzlaOptions {
    _unused: [u8; 0],
}
extern "C" {
    #[doc = " Create a new BitwuzlaOptions instance.\n\n The returned instance must be deleted via `bitwuzla_options_delete()`.\n\n @return A pointer to the created BitwuzlaOptions instance.\n\n @see\n   * `bitwuzla_options_delete`"]
    pub fn bitwuzla_options_new() -> *mut BitwuzlaOptions;
}
extern "C" {
    #[doc = " Delete a BitwuzlaOptions instance.\n\n The given instance must have been created via `bitwuzla_options_new()`.\n\n @param options The BitwuzlaOptions instance to delete.\n\n @see\n   * `bitwuzla_options_new`"]
    pub fn bitwuzla_options_delete(options: *mut BitwuzlaOptions);
}
extern "C" {
